loadtest.yml
config:
  target: http://34.77.90.252
  phases:
    - duration: 20
      arrivalRate: 1
      maxVusers: 2
      name: Warm up phase
    - duration: 30
      arrivalRate: 1
      maxVusers: 2
      name: Spike phase

  plugins:
    metrics-by-endpoint: {}
scenarios:
  - flow:
      - loop:
          - post:
              url: "/2015-03-31/functions/function/invocations"
              json:
                n: 5250000